{
  "WorkshopId": 3376759873,
  "Title": "Item Recoiler",
  "Description": "Adds a different kind of recoiler to the game -- one that recoils items, not the player. It mostly functions just like a regular [url=https:\\/\\/wiki.cavesofqud.com\\/wiki\\/Reprogrammable_recoiler]reprogrammable recoiler[\\/url], except when activated, it displays a container window, and any items placed in it when the window closes are teleported to the imprinted location.\\r\\n\\r\\nMost other aspects are unchanged -- it requires energy to function, it can be found, bought, sold, created from a schematic or disassembled for bits, etc.\\r\\n\\r\\n[h1]Features and details[\\/h1]\\r\\n[list]\\r\\n  [*][b]Acquiring[\\/b]: All characters automatically get one free recoiler (with a [url=https:\\/\\/wiki.cavesofqud.com\\/wiki\\/Solar_cell]solar cell[\\/url]) per game at the start of the game, or when loading a game after installing the mod. This can be turned off in options.\\r\\n  [*][b]Holographic receiver[\\/b]: When you imprint an item recoiler, it places a holographic receiver (shaped like a purple-colored chest) as a marker in that location. This marks the place for recoil and makes item access more convenient, however, the box itself is a hologram and can't be interacted with (picked up, destroyed, etc.). And when the recoiler is programmed with a new location, the receiver will move, but any items still \\\"in\\\" it will remain.\\r\\n  [*][b]Recoiling the recoiler[\\/b]: Item recoilers themselves can't be recoiled. If placed in the teleportation \\\"container\\\", they will simply return to the player's inventory once the teleportation begins. \\r\\n  [*][b]Energy cost[\\/b]: The energy cost of recoiling items is equal to their total weight, rounded up to the nearest full pound. If you're using a low energy cell (such as the starting solar one), beware of recoiling heavy objects (corpses, stones) unless you have a way to recharge.\\r\\n  [*][b]Keyboard shortcut[\\/b]: If you're recoiling items frequently, you can assign a keyboard shortcut for quick activation in the game's control mappings (I like `Shift+Q`). Note that quick activation can't choose between multiple item recoilers, you'll have to use the regular Recoil ability if you're carrying more than one.\\r\\n  [*][b]Find imprint[\\/b]: The recoiler changes its name depending on where it's imprinted, but if that's not enough to find a lost imprint point, you can use the \\\"find imprint\\\" function. It will tell you the world map coordinates (`X:Y`, starting from the top left corner), parasang name, zone (one of the 9 regions that each parasang has) and depth (if the parasang has more than the surface level).\\r\\n[\\/list]\\r\\n\\r\\n[h1]License and source code[\\/h1]\\r\\nThis work \\u00A9 2024 is licensed under [url=https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/4.0\\/]Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International[\\/url].\\r\\n\\r\\nSource code is hosted on [url=https:\\/\\/github.com\\/modo-lv\\/caves-of-qud-mods\\/tree\\/main\\/ItemRecoiler]GitHub[\\/url].",
  "Tags": "Stable,Beta,Item,Tool,Script",
  "Visibility": "2",
  "ImagePath": "preview.png"
}